In [0]:
###REQUESTS


import requests

In [0]:
url="https://www.google.com/search?q=dhoni&sxsrf=ALeKk03QHLrcj8oBE8brZLEt_b0ftHHFoQ:1591351786145&source=lnms&tbm=isch&sa=X&ved=2ahUKEwjL17Ovt-rpAhUJcCsKHZ1JDMgQ_AUoAnoECCUQBA#imgrc=kB1Xi_Pevi-LZM"

In [0]:
result=requests.get(url)

In [0]:
result.status_code

200

In [0]:
result

In [0]:
file=open("Dhoni.jpg","wb")

In [0]:
file.write(result.content)

29414

In [0]:
file.close()

In [0]:
import os

In [0]:
url="https://graph.facebook.com/{}/picture?type=large"

In [0]:
if not "fb_displaypics" in os.listdir():
  os.mkdir("fb_displaypics")
for i in range(4,20):
  res=requests.get(url.format(i))
  with open("fb_displaypics/{}_img.jpg".format(i),"wb") as file:
     file.write(res.content)

In [0]:
import pandas as pd

In [0]:
df=pd.DataFrame({'col1':[1,2,3,4],
                        'col2':[111,222,333,444],
                        'col3':['abc','def','ghi','xyz']
                        })
df.head()

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   444  xyz

In [0]:
df['col2'].unique()

array([111, 222, 333, 444])

In [0]:
df['col2'].nunique() ###normal unique

4

In [0]:
df['col2'].value_counts()

111    1
222    1
333    1
444    1
Name: col2, dtype: int64

In [0]:
newdf=df[(df['col1']>2) & (df['col2']==444) ]

In [0]:
newdf

   col1  col2 col3
3     4   444  xyz

In [0]:
def times_3(x):
  return x*3

In [0]:
df['col1'].apply(times_3)

0     3
1     6
2     9
3    12
Name: col1, dtype: int64

In [0]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [0]:
df['col1'].sum()

10

In [0]:
df['col1']

0    1
1    2
2    3
3    4
Name: col1, dtype: int64

In [0]:
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   333  ghi
3     4   444  xyz

In [0]:
del df['col1']

In [0]:
df

   col2 col3
0   111  abc
1   222  def
2   333  ghi
3   444  xyz

In [0]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [0]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [0]:
df

   col2 col3
0   111  abc
1   222  def
2   333  ghi
3   444  xyz

In [0]:
df.sort_values(by='col2')

   col2 col3
0   111  abc
1   222  def
2   333  ghi
3   444  xyz

In [0]:
df.isnull()###if null true

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [0]:
df.dropna() ###for nan values

   col2 col3
0   111  abc
1   222  def
2   333  ghi
3   444  xyz

In [0]:
data = {
      'A':['foo','foo','foo','bar','bar','bar'],
      'B':['one','one','two','two','one','one'],
      'C':['x','y','x','y','x','y'],
      'D':[1,3,2,5,4,1]
}


df=pd.DataFrame(data)

In [0]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [0]:
df.pivot_table(values='D',index=['A','B'],columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [0]:
import pandas as pd

In [0]:
data={'Company':['GOOGLE','GOOGLE','GOOGLE','MICROSOFT','MICROSOFT','FB','FB'],
      'Person':['Prajna','Ajay','Sridhar Sir','Prajwal','Sahadev','Aravindh','Ajay'],
      'Sales':[200,120,340,124,243,350,560]    
      }
df1=pd.DataFrame(data)

In [0]:
df1

     Company       Person  Sales
0     GOOGLE       Prajna    200
1     GOOGLE         Ajay    120
2     GOOGLE  Sridhar Sir    340
3  MICROSOFT      Prajwal    124
4  MICROSOFT      Sahadev    243
5         FB     Aravindh    350
6         FB         Ajay    560

In [0]:
df1.groupby('Company')

In [0]:
by_company=df1.groupby('Company')

In [0]:
by_company.mean()

           Sales
Company
FB         455.0
GOOGLE     220.0
MICROSOFT  183.5

In [0]:
by_company.std()

                Sales
Company
FB         148.492424
GOOGLE     111.355287
MICROSOFT   84.145707

In [0]:
by_company.min()

            Person  Sales
Company
FB            Ajay    350
GOOGLE        Ajay    120
MICROSOFT  Prajwal    124

In [0]:
by_company.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
FB          2.0  455.0  148.492424  350.0  402.50  455.0  507.50  560.0
GOOGLE      3.0  220.0  111.355287  120.0  160.00  200.0  270.00  340.0
MICROSOFT   2.0  183.5   84.145707  124.0  153.75  183.5  213.25  243.0

In [0]:
by_company.describe().transpose()

Company              FB      GOOGLE   MICROSOFT
Sales count    2.000000    3.000000    2.000000
      mean   455.000000  220.000000  183.500000
      std    148.492424  111.355287   84.145707
      min    350.000000  120.000000  124.000000
      25%    402.500000  160.000000  153.750000
      50%    455.000000  200.000000  183.500000
      75%    507.500000  270.000000  213.250000
      max    560.000000  340.000000  243.000000

In [0]:
by_company.describe().transpose()['GOOGLE']

Sales  count      3.000000
       mean     220.000000
       std      111.355287
       min      120.000000
       25%      160.000000
       50%      200.000000
       75%      270.000000
       max      340.000000
Name: GOOGLE, dtype: float64

In [0]:
!git clone https://github.com/aniforverizon/nitte_data

Cloning into 'nitte_data'...
remote: Enumerating objects: 5, done.
remote: Counting objects: 100% (5/5), done.
remote: Compressing objects: 100% (4/4), done.
Unpacking objects: 100% (5/5), done.
remote: Total 5 (delta 0), reused 5 (delta 0), pack-reused 0

In [0]:
!ls

Dhoni.jpg  fb_displaypics  nitte_data  sample_data

In [0]:
!ls nitte_data

example  Excel_Sample.xlsx  multi_index_example

In [0]:
!cat nitte_data/example

a,b,c,d
0,1,2,3
4,5,6,7
8,9,10,11
12,13,14,15

In [0]:
dffile=pd.read_csv('nitte_data/example')

In [0]:
dffile.to_csv('example',index=False)

In [0]:
!ls nitte_data

example  Excel_Sample.xlsx  multi_index_example

In [0]:
pd.read_excel('nitte_data/Excel_Sample.xlsx',)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [0]:
df=pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [0]:
df[0]

                             Bank Name  ...       Closing Date
0                 The First State Bank  ...      April 3, 2020
1                   Ericson State Bank  ...  February 14, 2020
2     City National Bank of New Jersey  ...   November 1, 2019
3                        Resolute Bank  ...   October 25, 2019
4                Louisa Community Bank  ...   October 25, 2019
..                                 ...  ...                ...
556                 Superior Bank, FSB  ...      July 27, 2001
557                Malta National Bank  ...        May 3, 2001
558    First Alliance Bank & Trust Co.  ...   February 2, 2001
559  National State Bank of Metropolis  ...  December 14, 2000
560                   Bank of Honolulu  ...   October 13, 2000

[561 rows x 6 columns]